HOCOOH/STM32-Authentication/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2015 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "i2c.h"
#include "usart.h"
#include "gpio.h"
#include "string.h"
#include "SM3.h"
#include "stdlib.h"
#include "flash.h"

/* USER CODE BEGIN Includes */
#include "zlg7290.h"
#include "stdio.h"
#include <time.h>
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
#define ZLG_READ_ADDRESS1         0x01
#define ZLG_READ_ADDRESS2         0x10
#define ZLG_WRITE_ADDRESS1        0x10
#define ZLG_WRITE_ADDRESS2        0x11
#define BUFFER_SIZE1              (countof(Tx1_Buffer))
#define BUFFER_SIZE2              (countof(Rx2_Buffer))
#define countof(a) (sizeof(a) / sizeof(*(a)))
#define PASS_STORE_ADDR 0x080E0000

/*
#define MAX_USERNAME_LEN 6
#define MIN_USERNAME_LEN 3
#define MAX_PASSWORD_LEN 8
#define MIN_PASSWORD_LEN 5
#define N_WORKER 5
*/

#define N_STATE 6
#define STATE_INIT 0
#define STATE_WAIT 1
#define STATE_INPUT 2
#define STATE_CHECK 3
#define STATE_EDIT 4
#define STATE_EXCEPTION 5

#define EXCEPT_UNVALIAD_STATE 1
#define EXCEPT_TIMEOUT 2
#define EXCEPT_PASSLEN_LONG 3
#define EXCEPT_PASSLEN_SHORT 4

#define MAX_PASSWORD_LEN 12
#define MIN_PASSWORD_LEN 5
#define DIGEST_LEN 32

#define REFRESH_COUNT_INIT 500
#define HOT_BOOT_FLAG 0x1234ABCD
#define TIMEOUT_THRESHOLD 5

#define N_BACKUP 3

typedef struct {
    u8 currentState;
    u8 lastState;
    u8 errorCode;
} State;

u32 boot_flag __attribute__((at(0x10000004)));

u32 refreshCount = 0;
u8 hashMark = 0;
State state = {STATE_INIT, STATE_EXCEPTION, 0};
State stateBackup[N_BACKUP + 1] = {0};
uint8_t flag;//²»Í¬µÄ°´¼üÓÐ²»Í¬µÄ±êÖ¾Î»Öµ
uint8_t flagInterrupt = 0;//ÖÐ¶Ï±êÖ¾Î»£¬Ã¿´Î°´¼ü²úÉúÒ»´ÎÖÐ¶Ï£¬²¢¿ªÊ¼¶ÁÈ¡8¸öÊýÂë¹ÜµÄÖµ
uint8_t Rx2_Buffer[8]={0};
uint8_t Tx1_Buffer[8]={0};
uint8_t Rx1_Buffer[1]={0};
uint8_t edit_mode = 0;
clock_t check_time, last_check_time = 0;
double delay_choices[] = {0.05, 0.01, 0.015};

uint8_t pass_buf[MAX_PASSWORD_LEN + 1] = {0};
uint8_t pass_buf_sm3[DIGEST_LEN + 1] = {0};
uint8_t pass_store[MAX_PASSWORD_LEN + 1] = {0x1, 0x2, 0x3, 0x4, 0x5, 0x6, 0, 0};
u32 pass_test[MAX_PASSWORD_LEN + 1] = {0x1, 0x2, 0x3, 0x4, 0x5, 0x6, 0, 0};

uint8_t pass_store_sm3[DIGEST_LEN + 1] = {0};
u32 passwdCRC = 0;
u8 passwdBackupSM3[N_BACKUP + 1][DIGEST_LEN + 1] = {0};
u32 passwdCRCBackup[N_BACKUP + 1] = {0};
u8 prev_state_table[N_STATE][N_STATE] = {	
									{0, 0, 0, 0, 0, 1}, 
									{1, 0, 1, 1, 1, 0},
									{0, 1, 0, 0, 0, 0},
									{0, 0, 1, 0, 0, 0},
									{0, 0, 1, 0, 0, 0},
									{1, 1, 1, 1, 1, 0} }; // exception´ýÌí¼Ó
uint8_t input_cursor = 0;

// cold boot and hot boot

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void swtich_key(void);
void switch_flag(void);
void disp_str(uint8_t* code);
uint8_t cmp(uint8_t* arr1, uint8_t* arr2, uint8_t len);
uint32_t len(uint8_t* arr);
void disp_in_serial(uint8_t* arr);
void UpdateState(u8 nextState);
u8 IsStateValid(u8 expectState);
void rand_delay();
void UpdatePasswdBackup();
u8 IsPasswdValid();
u8 ResumePasswd(u8* validMask);
void mymemcpy(void* dest, const void* src, u32 len);
int main(void) {
		
    if (boot_flag != HOT_BOOT_FLAG) {
        // cold boot
				boot_flag = HOT_BOOT_FLAG;
        // init
        state.currentState = STATE_INIT;
        state.lastState = STATE_EXCEPTION;
        state.errorCode = 0;
    } else {
        // hot boot
        // load the backend vars and check
			//printf("Hot boot\n");

    }
    
    // printf("\n\r");
    // printf("\n\r===================================\n\r");
    // printf("\n\r FS-STM32Éí·ÝÑéÖ¤ÏµÍ³\n\r");
    // printf("\n\r test : len(pass_store):%d\n\r", len(pass_store));
    // printf("\n\r test : pass_store:\n\r");
    // disp_in_serial(pass_store);
    
    // SM3_Hash(pass_store, len(pass_store), (void*)pass_store_sm3);
    // printf("SM3¹þÏ£ºóµÄpass_store:\n\r");
    // disp_in_serial(pass_store_sm3);
    // printf("\n\r");

    // Ö÷Ñ­»·
    while (1) {
        /* ³õÊ¼»¯×´Ì¬ */
        if (state.currentState == STATE_INIT) {
						
            /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
            HAL_Init();

            /* Configure the system clock */
            SystemClock_Config();

            /* Initialize all configured peripherals */
            MX_GPIO_Init();
            MX_I2C1_Init();
            MX_USART1_UART_Init();
            //MX_CRC_Init();
						
						// write pass_store from flash
						STMFLASH_Write(PASS_STORE_ADDR, pass_test, MAX_PASSWORD_LEN);
						u32 pass_read_test[MAX_PASSWORD_LEN  + 1];
						STMFLASH_Read(PASS_STORE_ADDR, pass_read_test, MAX_PASSWORD_LEN);
						printf("After read!\n");
						printf("%x %x %x %x\n",pass_read_test[0], pass_read_test[1], pass_read_test[2],pass_read_test[3]);
						
					
            /* Initialize variables */
            refreshCount = REFRESH_COUNT_INIT;
            input_cursor = 0;
						edit_mode = 0;
            for (int i = 0; i < MAX_PASSWORD_LEN; i++) {
                pass_buf[i] = 0;
            }
            
            rand_delay();
            SM3_Hash(pass_store, len(pass_store), (void*)pass_store_sm3);
            UpdatePasswdBackup();

            // switch to state wait
            UpdateState(STATE_WAIT);
        }
        /* ´ý»ú×´Ì¬ */
        else if (state.currentState == STATE_WAIT) {
            rand_delay();
            if (IsStateValid(STATE_WAIT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            input_cursor = 0;
            /* ¼ì²âµ½ÊäÈë£¬×ªµ½ÊäÈë×´Ì¬ */
            if (flagInterrupt == 1) {
                UpdateState(STATE_INPUT);
                continue;
            }
            // set refresh timer 
            if (refreshCount-- == 0) {
                //UpdateState(STATE_INIT);
                //continue;
            }
        }
        /* ÊäÈë×´Ì¬ */
        else if (state.currentState == STATE_INPUT) {
            rand_delay();
            last_check_time = clock();
            if (IsStateValid(STATE_INPUT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // get input 
            while (input_cursor < MAX_PASSWORD_LEN) {
                if(flagInterrupt == 1) {
                    // time out
									/*
                    check_time = clock();
                    if ((double)check_time - (double)last_check_time 
                        / CLOCKS_PER_SEC > TIMEOUT_THRESHOLD) {
                        // disp tmout
                        state.errorCode = EXCEPT_TIMEOUT;
                        UpdateState(STATE_EXCEPTION); // return wait state 
												goto expcetion_handler;
                    } else {
                        last_check_time = check_time;
                    }
									*/

                    flagInterrupt = 0;
                    I2C_ZLG7290_Read(&hi2c1,0x71,0x01,Rx1_Buffer,1);	//¶Á¼üÖµ
                    swtich_key();	//É¨Ãè¼üÖµ£¬Ð´±êÖ¾Î»
                    I2C_ZLG7290_Read(&hi2c1,0x71,0x10,Rx2_Buffer,8);	//¶Á8Î»ÊýÂë¹Ü
                    switch_flag();	//É¨Ãèµ½ÏàÓ¦µÄ°´¼ü²¢ÇÒÏòÊýÂë¹ÜÐ´½øÊýÖµ
                    printf("flag: %d\n\r", flag);

                    if (flag == 14) {// #
                        printf("Password input done!\n\r");
                        hashMark = 0;
                        break;
                    }
                    else if (flag == 16 && hashMark == 0) { // *
                        printf("Edit password\n\r");
                        hashMark = 1;
                        break;
                    }
                    else {
                        pass_buf[input_cursor++] = flag;
                    }
                }
              // todo: Òì³£!!!:ÎÞÐ§µÄ×Ö·û
            }
						pass_buf[input_cursor] = 0;
            // Òì³£: ÃÜÂë³¤¶È¹ý³¤
            if (input_cursor >= MAX_PASSWORD_LEN) {
                printf("Password is too long\n\r");
                state.errorCode = EXCEPT_PASSLEN_LONG;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // Òì³£: ÃÜÂë³¤¶È¹ý¶Ì
            else if (input_cursor < MIN_PASSWORD_LEN) {
                printf("Password is too short\n\r");
                state.errorCode = EXCEPT_PASSLEN_SHORT;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // todo: ÖØ¸´ÊäÈë**********************
						IsStateValid(STATE_INPUT);
						printf("editmode:%d\n", edit_mode);
            /* ÊäÈëºÏ·¨ */
            if (edit_mode == 1) {
                UpdateState(STATE_EDIT);
            }
            else {
								printf("test!!!!\n");
								IsStateValid(STATE_INPUT);
								UpdateState(STATE_CHECK);
								IsStateValid(STATE_INPUT);
							
