HOCOOH/STM32-Authentication/Src/main.c
            }

        }
        /* ÅÐ¶ÏÃÜÂë×´Ì¬ */
        else if (state.currentState == STATE_CHECK) {
            rand_delay();
            if (IsStateValid(STATE_CHECK)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // printf("\n\rlen: %d  ", input_cursor);
            // printf("pass_buf:\n\r");
            // disp_in_serial(pass_buf);
            /* ¶ÔÊäÈëµÄÃÜÂë½øÐÐSM3ÕªÒª */
            SM3_Hash(pass_buf, len(pass_buf), (void*)pass_buf_sm3);
            printf("SM3 hash value of pass_buf: ");
            disp_in_serial(pass_buf_sm3);
            printf("SM3 hash value of pass_store: ");
            disp_in_serial(pass_store_sm3);
            
            /* ±È¶ÔÊäÈëÕªÒªºÍÕæÊµÃÜÂëÕªÒª */
            if (IsPasswdValid()) {
                printf("´æ´¢µÄÃÜÂëËð»µÇÒÎÞ·¨»Ö¸´\n\r");
                while (1) {}
            }
            int cmp_res = cmp(pass_buf_sm3, pass_store_sm3, input_cursor);
            if (cmp_res == 0) { // Æ¥Åä
                // ÏÔÊ¾success
                printf("password match!\n\r");
                uint8_t success_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
                disp_str(success_code);
            
            } else { // ²»Æ¥Åä
                // ÏÔÊ¾error
                printf("password not match!\n\r");
                // todo: edit code
                uint8_t error_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
                disp_str(error_code);
            }
            
            /* ·µ»Ø´ý»ú×´Ì¬ */
            edit_mode = hashMark;
            UpdateState(STATE_WAIT);
        }
        /* ÐÞ¸ÄÃÜÂë×´Ì¬ */
        else if (state.currentState == STATE_EDIT) {
            rand_delay();
            if (IsStateValid(STATE_EDIT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }

            // ¸üÐÂÃÜÂë
            for (int i = 0; i < MAX_PASSWORD_LEN; i++) {
                if (i < input_cursor)
                    pass_store[i] = pass_buf[i];
                else
                    pass_store[i] = 0;
            }
            SM3_Hash(pass_store, len(pass_store), (void*)pass_store_sm3);
            UpdatePasswdBackup();

            // ÏÔÊ¾update
            uint8_t up_code[] = {0xCE, 0x7C};
            disp_str(up_code);
            printf("Password update to:\n");
            disp_in_serial(pass_store);
            
            /* ·µ»Ø´ý»ú×´Ì¬ */
            edit_mode = 0;
            UpdateState(STATE_WAIT);
        }
        /* Òì³£×´Ì¬ */
        else {	// default Òì³£
//expcetion_handler:
            rand_delay();
            // =============
            uint8_t error_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
            disp_str(error_code);
            // ÐèÒªÑÓÊ±!!!
            switch (state.errorCode) {
                case EXCEPT_UNVALIAD_STATE:
										printf("unvaliad state!\n");
                   // UpdateState(STATE_INIT);
                    break;
                case EXCEPT_TIMEOUT:
										printf("time out!\n");
                    //UpdateState(STATE_WAIT);
                    break;
                case EXCEPT_PASSLEN_LONG:
									printf("pass long!\n");
                   // UpdateState(STATE_WAIT);
                    break;
                case EXCEPT_PASSLEN_SHORT:
									printf("pass short!\n");
                   // UpdateState(STATE_WAIT);
                    break;
                default:
                    //UpdateState(STATE_INIT);
            }
						UpdateState(STATE_INIT);
        }
    }

}

u8 IsStateValid(u8 expectState) {
	//printf("current state:%d\n", state.currentState);
		//("last state:%d\n", state.lastState);
	if (state.currentState != expectState) {
		return 1;
	}

	// check pre state
	u8 check_pre_res = prev_state_table[state.currentState][state.lastState];
	
	if (check_pre_res == 0) {
		
		return 1;
	}

	return 0;	
}

void UpdateState(u8 nextState) {
    // TODO: check if next state is vaild
    state.lastState = state.currentState;
    state.currentState = nextState;
    // TODO: edit error code 
    if (nextState != STATE_EXCEPTION) {
        state.errorCode = 0;
    }

    // todo: ±¸·Ýstate
}

void UpdatePasswdBackup() {
  passwdCRC = 0;  
	// passwdCRC = HAL_CRC_Calculate(&hcrc, (u32*)pass_store_sm3, DIGEST_LEN / 4);
    for (int i = 0; i < N_BACKUP; i++) {
        for (int j = 0; j < MAX_PASSWORD_LEN; j++) {
            passwdBackupSM3[i][j] = pass_store_sm3[j];
        }
				passwdCRCBackup[i] = 0;
        //passwdCRCBackup[i] = HAL_CRC_Calculate(&hcrc, (u32*)passwdBackupSM3[i], DIGEST_LEN / 4);
    }
}

u8 IsPasswdValid() {
    u8 flag = 0;
    u8 validMask[N_BACKUP + 1] = {0};
    /* Ê×ÏÈÐ£ÑéÃÜÂë±¸·Ý */
    u32 tmpCRC = 0;
    for (int i = 0; i < N_BACKUP; i++) {
			tmpCRC = 0;
        //tmpCRC = HAL_CRC_Calculate(&hcrc, (u32*)passwdBackupSM3[i], DIGEST_LEN / 4);
        if (tmpCRC == passwdCRCBackup[i]) {
            validMask[i] = 1;
        }
    }
		tmpCRC = 0;
    // tmpCRC = HAL_CRC_Calculate(&hcrc, (u32*)pass_store_sm3, DIGEST_LEN / 4);
    /* ¼ì²éÃÜÂë¹þÏ£ */
    if (tmpCRC != passwdCRC) {
        flag = 1;
    }
    else {
        validMask[N_BACKUP] = 1;
        passwdCRCBackup[N_BACKUP] = tmpCRC;
        mymemcpy((void*)passwdCRCBackup[N_BACKUP], (void*)pass_store_sm3, DIGEST_LEN);
        for (int i = 0; i < N_BACKUP; i++) {
            if (validMask[i] && passwdCRCBackup[i] != passwdCRC) {
                flag = 1;
            }
        }
    }

    /* ÈôÃÜÂëÊ§Ð§£¬³¢ÊÔ»Ö¸´ */
    if (flag) {
        flag = ResumePasswd(validMask);
    }

    return flag;
}

u8 ResumePasswd(u8* validMask) {
    u8 validCnt[N_BACKUP + 1] = {0};
    for (int i = 0; i <= N_BACKUP; i++) {
        for (int j = 0; j <= N_BACKUP; j++) {
            if (validMask[i] && validMask[j] && passwdCRCBackup[i] == passwdCRCBackup[j]) {
                validCnt[i]++;
            }
        }
    }
    
